# DBeam_SetLightOrigin

## Description
Set light origin for the beam.

```pascal
PROCEDURE DBeam_SetLightOrigin(origin : REAL);
```

```python
def vs.DBeam_SetLightOrigin(origin):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|origin|REAL|   |

## Examples
```pascal
DBeam_SetLightOrigin(1.0);
```
```python
import vs

# Set light origin for the beam.
origin = 1.0

vs.DBeam_SetLightOrigin(origin)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight